; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image1 - mode
	spectrograph0 - mode
	thermograph5 - mode
	spectrograph7 - mode
	infrared2 - mode
	image8 - mode
	image6 - mode
	thermograph3 - mode
	image4 - mode
	Star2 - direction
	GroundStation0 - direction
	Star3 - direction
	Star4 - direction
	GroundStation1 - direction
	Phenomenon5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 image6)
	(calibration_target instrument0 Star4)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 spectrograph7)
	(supports instrument2 image4)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon5)
	(supports instrument3 infrared2)
	(supports instrument3 spectrograph7)
	(supports instrument3 image6)
	(calibration_target instrument3 Star3)
	(supports instrument4 image6)
	(supports instrument4 spectrograph7)
	(calibration_target instrument4 Star4)
	(supports instrument5 thermograph5)
	(supports instrument5 image8)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon9)
)
(:goal (and
	(pointing satellite0 Phenomenon7)
	(have_image Phenomenon5 thermograph5)
	(have_image Phenomenon5 infrared2)
	(have_image Star6 infrared2)
	(have_image Star6 spectrograph0)
	(have_image Star6 image1)
	(have_image Phenomenon7 spectrograph7)
	(have_image Phenomenon8 thermograph5)
	(have_image Phenomenon9 thermograph3)
	(have_image Phenomenon9 thermograph5)
))

)

; plan
1. (turn_to satellite1 star3 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star3)
   goals met: 0 of 10
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 10
3. (calibrate satellite1 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 0 of 10
4. (turn_to satellite1 star6 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star6)
   goals met: 0 of 10
5. (take_image satellite1 star6 instrument3 infrared2)
   added: (have_image star6 infrared2)
   goals met: 1 of 10
6. (turn_to satellite1 phenomenon5 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon5)
   goals met: 1 of 10
7. (take_image satellite1 phenomenon5 instrument3 infrared2)
   added: (have_image phenomenon5 infrared2)
   goals met: 2 of 10
8. (turn_to satellite1 groundstation1 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 groundstation1)
   goals met: 2 of 10
9. (turn_to satellite0 groundstation0 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 groundstation0)
   goals met: 2 of 10
10. (switch_off instrument3 satellite1)
   deleted: (power_on instrument3)
   added: (power_avail satellite1)
   goals met: 2 of 10
11. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 2 of 10
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 10
13. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 2 of 10
14. (calibrate satellite1 instrument5 groundstation1)
   added: (calibrated instrument5)
   goals met: 2 of 10
15. (turn_to satellite0 star6 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star6)
   goals met: 2 of 10
16. (take_image satellite0 star6 instrument1 spectrograph0)
   added: (have_image star6 spectrograph0)
   goals met: 3 of 10
17. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 3 of 10
18. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 3 of 10
19. (turn_to satellite0 groundstation1 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation1)
   goals met: 3 of 10
20. (calibrate satellite0 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 3 of 10
21. (turn_to satellite0 star6 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star6)
   goals met: 3 of 10
22. (take_image satellite0 star6 instrument2 image1)
   added: (have_image star6 image1)
   goals met: 4 of 10
23. (turn_to satellite0 phenomenon7 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon7)
   goals met: 5 of 10
24. (take_image satellite0 phenomenon7 instrument2 spectrograph7)
   added: (have_image phenomenon7 spectrograph7)
   goals met: 6 of 10
25. (turn_to satellite1 phenomenon5 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon5)
   goals met: 6 of 10
26. (take_image satellite1 phenomenon5 instrument5 thermograph5)
   added: (have_image phenomenon5 thermograph5)
   goals met: 7 of 10
27. (turn_to satellite1 phenomenon8 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon8)
   goals met: 7 of 10
28. (take_image satellite1 phenomenon8 instrument5 thermograph5)
   added: (have_image phenomenon8 thermograph5)
   goals met: 8 of 10
29. (turn_to satellite1 phenomenon9 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon9)
   goals met: 8 of 10
30. (take_image satellite1 phenomenon9 instrument5 thermograph3)
   added: (have_image phenomenon9 thermograph3)
   goals met: 9 of 10
31. (take_image satellite1 phenomenon9 instrument5 thermograph5)
   added: (have_image phenomenon9 thermograph5)
   goals met: 10 of 10
